docs/dependencies.md
```mermaid
graph LR

contentserver[Content Server] --> catalystapispecs[catalyst-api-specs]
contentserver --> catalystclient["dcl-catalyst-client"]
contentserver --> catalystcontracts["@dcl/catalyst-contracts"]
contentserver --> contentvalidator["@dcl/content-validator"]
contentserver --> crypto["@dcl/crypto"]
contentserver --> hashing["@dcl/hashing"]
contentserver --> schemas["@dcl/schemas"]
contentserver --> snapshotsfetcher["@dcl/snapshots-fetcher"]
contentserver --> urnresolver["@dcl/urn-resolver"]
catalystclient --> catalystcommons["dcl-catalyst-commons"]
catalystclient --> catalystcontracts
catalystcontracts --> ethconnect["eth-connect"]
contentvalidator --> contenthashtree["@dcl/content-hash-tree"]
contentvalidator --> hashing
contentvalidator --> schemas
contentvalidator --> urnresolver
crypto --> schemas
crypto --> ethconnect
snapshotsfetcher --> catalyststorage["@dcl/catalyst-storage"]
snapshotsfetcher --> hashing
snapshotsfetcher --> schemas
```
